In [12]:
def func(myTuple):
    first,second = myTuple
    return first + second

myTuple(5,10)
print(func(myTuple))
print(func(5,10))

NameError: name 'myTuple' is not defined

In [3]:
def add(tup):
    sum=0
    for i in tup:
        sum=sum+i
    print(sum)   
tup=(1,2,4,6)
add(tup)

13

In [8]:
l1 = [56,24,63,90]
l2= [12,85,89,12]
t1 = zip(l1,l2)
print(list(t1))
print("according first element")

[(56, 12), (24, 85), (63, 89), (90, 12)]

In [10]:
l1=[56,24,63,90]
l2=[85,12,89,12]
t1=(list(zip(l1,l2)))
t1.sort(key = lambda x: x[1])
print("according second element")
print(t1)
print("according first element")
t1.sort()
print(t1)

according second element
[(24, 12), (90, 12), (56, 85), (63, 89)]
according first element
[(24, 12), (56, 85), (63, 89), (90, 12)]

In [11]:
l1 = [56, 24, 63, 90]
l2 = [12, 85, 89, 12]
l3 = list(zip(l1, l2))
print ("List of tuples:", l3)
l3.sort (key = lambda x: x[0])
print ("Sorted according to first element:", l3)
l3.sort (key = lambda x : x[1])
print ("Sorted according to second element:", l3)

List of tuples: [(56, 12), (24, 85), (63, 89), (90, 12)]
Sorted according to first element: [(24, 85), (56, 12), (63, 89), (90, 12)]
Sorted according to second element: [(56, 12), (90, 12), (24, 85), (63, 89)]

In [13]:
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

# view the data
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [18]:

data1 =data.loc[(data.age >= 20)]
data2 =data1['section', 'city'] = ['S','Pune']

data2

<ipython-input-18-a7d1f825b4e1>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data2 =data1['section', 'city'] = ['S','Pune']

['S', 'Pune']

In [20]:
data = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 
                                'Mahindra', 'Maruti', 'Hyundai', 
                                'Renault', 'Tata', 'Maruti'], 
                     'Year' : [2012, 2014, 2011, 2015, 2012,  
                               2016, 2014, 2018, 2019], 
                     'Kms Driven' : [50000, 30000, 60000,  
                                     25000, 10000, 46000,  
                                     31000, 15000, 12000], 
                     'City' : ['Gurgaon', 'Delhi', 'Mumbai',  
                               'Delhi', 'Mumbai', 'Delhi',  
                               'Mumbai','Chennai',  'Ghaziabad'], 
                     'Mileage' :  [28, 27, 25, 26, 28,  
                                   29, 24, 21, 24]}) 
   
 
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [21]:
data.loc[(data.Year < 2015), ['Mileage']] = 22
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       22
1   Hyundai  2014       30000      Delhi       22
2      Tata  2011       60000     Mumbai       22
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       22
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       22
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [22]:
display(data.loc[(data.Brand == 'Maruti') & (data.Mileage > 25)])

Empty DataFrame
Columns: [Brand, Year, Kms Driven, City, Mileage]
Index: []

In [23]:
data1= pd.DataFrame({'age':[30, 2, 12, 4, 32, 33, 69],
                   'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'],
                   'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'],
                   'height':[165, 70, 120, 80, 180, 172, 150],
                   'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2],
                   'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX']
                   },
                  index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'])
display(data1)

           age  color    food  height  score state
Jane        30   blue   Steak     165    4.6    NY
Nick         2  green    Lamb      70    8.3    TX
Aaron       12    red   Mango     120    9.0    FL
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX
Cornelia    69    red   Beans     150    2.2    TX

In [25]:
# select row pinelope
data1.loc['Penelope']

age           4
color     white
food      Apple
height       80
score       3.3
state        AL
Name: Penelope, dtype: object

In [35]:
# selecting row cornelia,jane,dean
data2 =data1.loc[['Cornelia', 'Jane', 'Dean']]
display(data2)

          age color    food  height  score state
Cornelia   69   red   Beans     150    2.2    TX
Jane       30  blue   Steak     165    4.6    NY
Dean       32  gray  Cheese     180    1.8    AK

In [36]:
# selecting rows from Aaron to Dean
data3 =data1.loc['Aaron':'Dean']
display(data3)

          age  color    food  height  score state
Aaron      12    red   Mango     120    9.0    FL
Penelope    4  white   Apple      80    3.3    AL
Dean       32   gray  Cheese     180    1.8    AK

In [38]:
data1.iloc[4]
# selecting 4th index column

age           32
color       gray
food      Cheese
height       180
score        1.8
state         AK
Name: Dean, dtype: object

In [41]:
# selecting rows from 1 to 4 and 2nd column
data4 =data1.iloc[[1,4], 2]
display(data4)

Nick      Lamb
Dean    Cheese
Name: food, dtype: object